test/cassettes/Refund-Resource_710135213/creates-a-refund_2084766157/recording.har

{
  "log": {
    "_recordingName": "Refund Resource/creates a refund",
    "creator": {
      "comment": "persister:fs",
      "name": "Polly.JS",
      "version": "6.0.5"
    },
    "entries": [
      {
        "_id": "8c2c7f7751ae7f0389278dfc7008e453",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 503,
          "cookies": [],
          "headers": [
            {
              "name": "accept-encoding",
              "value": "gzip, deflate"
            },
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": 503
            },
            {
              "name": "host",
              "value": "api.easypost.com"
            }
          ],
          "headersSize": 493,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/json",
            "params": [],
            "text": "{\"shipment\":{\"to_address\":{\"name\":\"Jack Sparrow\",\"company\":\"EasyPost\",\"street1\":\"388 Townsend St\",\"street2\":\"Apt 20\",\"city\":\"San Francisco\",\"state\":\"CA\",\"zip\":\"94107\",\"phone\":\"5555555555\"},\"from_address\":{\"name\":\"Jack Sparrow\",\"company\":\"EasyPost\",\"street1\":\"388 Townsend St\",\"street2\":\"Apt 20\",\"city\":\"San Francisco\",\"state\":\"CA\",\"zip\":\"94107\",\"phone\":\"5555555555\"},\"parcel\":{\"length\":10,\"width\":8,\"height\":4,\"weight\":15.4},\"carrier_accounts\":[\"ca_5ba7ca3632c54adeb17ad4bcac13c890\"],\"service\":\"First\"}}"
          },
          "queryString": [],
          "url": "https://api.easypost.com/v2/shipments"
        },
        "response": {
          "bodySize": 2220,
          "content": {
            "encoding": "base64",
            "mimeType": "application/json; charset=utf-8",
            "size": 2220,
            "text": "{\"created_at\":\"2022-05-23T22:51:09Z\",\"is_return\":false,\"messages\":[],\"mode\":\"test\",\"options\":{\"currency\":\"USD\",\"payment\":{\"type\":\"SENDER\"},\"date_advance\":0},\"reference\":null,\"status\":\"unknown\",\"tracking_code\":\"9400100109361120469907\",\"updated_at\":\"2022-05-23T22:51:10Z\",\"batch_id\":null,\"batch_status\":null,\"batch_message\":null,\"customs_info\":null,\"from_address\":{\"id\":\"adr_d62ded72daea11ec83c1ac1f6b0a0d1e\",\"object\":\"Address\",\"created_at\":\"2022-05-23T22:51:09+00:00\",\"updated_at\":\"2022-05-23T22:51:09+00:00\",\"name\":\"Jack Sparrow\",\"company\":\"EasyPost\",\"street1\":\"388 Townsend St\",\"street2\":\"Apt 20\",\"city\":\"San Francisco\",\"state\":\"CA\",\"zip\":\"94107\",\"country\":\"US\",\"phone\":\"5555555555\",\"email\":null,\"mode\":\"test\",\"carrier_facility\":null,\"residential\":null,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{}},\"insurance\":\"50.00\",\"order_id\":null,\"parcel\":{\"id\":\"prcl_a4c8820b92f14a72b6cbeec16b48256d\",\"object\":\"Parcel\",\"created_at\":\"2022-05-23T22:51:09Z\",\"updated_at\":\"2022-05-23T22:51:09Z\",\"length\":10.0,\"width\":8.0,\"height\":4.0,\"predefined_package\":null,\"weight\":15.4,\"mode\":\"test\"},\"postage_label\":{\"object\":\"PostageLabel\",\"id\":\"pl_ec3be10097ac407c91377450260e8569\",\"created_at\":\"2022-05-23T22:51:09Z\",\"updated_at\":\"2022-05-23T22:51:09Z\",\"date_advance\":0,\"integrated_form\":\"none\",\"label_date\":\"2022-05-23T22:51:09Z\",\"label_resolution\":300,\"label_size\":\"4x6\",\"label_type\":\"default\",\"label_file_type\":\"image/png\",\"label_url\":\"https://easypost-files.s3.us-west-2.amazonaws.com/files/postage_label/20220523/444595dd1fab4a298fca17a94a24cf95.png\",\"label_pdf_url\":null,\"label_zpl_url\":null,\"label_epl2_url\":null,\"label_file\":null},\"rates\":[{\"id\":\"rate_1edf70f0d17247d0b8ee7c303e064f6f\",\"object\":\"Rate\",\"created_at\":\"2022-05-23T22:51:09Z\",\"updated_at\":\"2022-05-23T22:51:09Z\",\"mode\":\"test\",\"service\":\"Express\",\"carrier\":\"USPS\",\"rate\":\"23.75\",\"currency\":\"USD\",\"retail_rate\":\"27.40\",\"retail_currency\":\"USD\",\"list_rate\":\"23.75\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":null,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":null,\"shipment_id\":\"shp_ca76f3c8f81647308da5e422446b8d21\",\"carrier_account_id\":\"ca_5ba7ca3632c54adeb17ad4bcac13c890\"},{\"id\":\"rate_b51d4432a29e46e5a1d23bafd0376835\",\"object\":\"Rate\",\"created_at\":\"2022-05-23T22:51:09Z\",\"updated_at\":\"2022-05-23T22:51:09Z\",\"mode\":\"test\",\"service\":\"Priority\",\"carrier\":\"USPS\",\"rate\":\"7.37\",\"currency\":\"USD\",\"retail_rate\":\"8.70\",\"retail_currency\":\"USD\",\"list_rate\":\"7.37\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":1,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":1,\"shipment_id\":\"shp_ca76f3c8f81647308da5e422446b8d21\",\"carrier_account_id\":\"ca_5ba7ca3632c54adeb17ad4bcac13c890\"},{\"id\":\"rate_a5be3f5d369440eeaf04ce7a3961b62d\",\"object\":\"Rate\",\"created_at\":\"2022-05-23T22:51:09Z\",\"updated_at\":\"2022-05-23T22:51:09Z\",\"mode\":\"test\",\"service\":\"ParcelSelect\",\"carrier\":\"USPS\",\"rate\":\"7.22\",\"currency\":\"USD\",\"retail_rate\":\"7.22\",\"retail_currency\":\"USD\",\"list_rate\":\"7.22\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":2,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":2,\"shipment_id\":\"shp_ca76f3c8f81647308da5e422446b8d21\",\"carrier_account_id\":\"ca_5ba7ca3632c54adeb17ad4bcac13c890\"},{\"id\":\"rate_ed67e48729dd49c3aca2fc1569cafb42\",\"object\":\"Rate\",\"created_at\":\"2022-05-23T22:51:09Z\",\"updated_at\":\"2022-05-23T22:51:09Z\",\"mode\":\"test\",\"service\":\"First\",\"carrier\":\"USPS\",\"rate\":\"5.49\",\"currency\":\"USD\",\"retail_rate\":\"5.49\",\"retail_currency\":\"USD\",\"list_rate\":\"5.49\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":2,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":2,\"shipment_id\":\"shp_ca76f3c8f81647308da5e422446b8d21\",\"carrier_account_id\":\"ca_5ba7ca3632c54adeb17ad4bcac13c890\"}],\"refund_status\":null,\"scan_form\":null,\"selected_rate\":{\"id\":\"rate_ed67e48729dd49c3aca2fc1569cafb42\",\"object\":\"Rate\",\"created_at\":\"2022-05-23T22:51:09Z\",\"updated_at\":\"2022-05-23T22:51:09Z\",\"mode\":\"test\",\"service\":\"First\",\"carrier\":\"USPS\",\"rate\":\"5.49\",\"currency\":\"USD\",\"retail_rate\":\"5.49\",\"retail_currency\":\"USD\",\"list_rate\":\"5.49\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":2,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":2,\"shipment_id\":\"shp_ca76f3c8f81647308da5e422446b8d21\",\"carrier_account_id\":\"ca_5ba7ca3632c54adeb17ad4bcac13c890\"},\"tracker\":{\"id\":\"trk_d0c5cfff0e6640f792aba7c677955806\",\"object\":\"Tracker\",\"mode\":\"test\",\"tracking_code\":\"9400100109361120469907\",\"status\":\"unknown\",\"status_detail\":\"unknown\",\"created_at\":\"2022-05-23T22:51:10Z\",\"updated_at\":\"2022-05-23T22:51:10Z\",\"signed_by\":null,\"weight\":null,\"est_delivery_date\":null,\"shipment_id\":\"shp_ca76f3c8f81647308da5e422446b8d21\",\"carrier\":\"USPS\",\"tracking_details\":[],\"fees\":[],\"carrier_detail\":null,\"public_url\":\"https://track.easypost.com/djE6dHJrX2QwYzVjZmZmMGU2NjQwZjc5MmFiYTdjNjc3OTU1ODA2\"},\"to_address\":{\"id\":\"adr_d62c0d79daea11ecb83fac1f6bc7b362\",\"object\":\"Address\",\"created_at\":\"2022-05-23T22:51:09+00:00\",\"updated_at\":\"2022-05-23T22:51:09+00:00\",\"name\":\"JACK SPARROW\",\"company\":\"EASYPOST\",\"street1\":\"388 TOWNSEND ST APT 20\",\"street2\":null,\"city\":\"SAN FRANCISCO\",\"state\":\"CA\",\"zip\":\"94107-1670\",\"country\":\"US\",\"phone\":\"5555555555\",\"email\":null,\"mode\":\"test\",\"carrier_facility\":null,\"residential\":true,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{\"zip4\":{\"success\":true,\"errors\":[],\"details\":null},\"delivery\":{\"success\":true,\"errors\":[],\"details\":{\"latitude\":37.77551,\"longitude\":-122.39697,\"time_zone\":\"America/Los_Angeles\"}}}},\"usps_zone\":1,\"return_address\":{\"id\":\"adr_d62ded72daea11ec83c1ac1f6b0a0d1e\",\"object\":\"Address\",\"created_at\":\"2022-05-23T22:51:09+00:00\",\"updated_at\":\"2022-05-23T22:51:09+00:00\",\"name\":\"Jack Sparrow\",\"company\":\"EasyPost\",\"street1\":\"388 Townsend St\",\"street2\":\"Apt 20\",\"city\":\"San Francisco\",\"state\":\"CA\",\"zip\":\"94107\",\"country\":\"US\",\"phone\":\"5555555555\",\"email\":null,\"mode\":\"test\",\"carrier_facility\":null,\"residential\":null,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{}},\"buyer_address\":{\"id\":\"adr_d62c0d79daea11ecb83fac1f6bc7b362\",\"object\":\"Address\",\"created_at\":\"2022-05-23T22:51:09+00:00\",\"updated_at\":\"2022-05-23T22:51:09+00:00\",\"name\":\"JACK SPARROW\",\"company\":\"EASYPOST\",\"street1\":\"388 TOWNSEND ST APT 20\",\"street2\":null,\"city\":\"SAN FRANCISCO\",\"state\":\"CA\",\"zip\":\"94107-1670\",\"country\":\"US\",\"phone\":\"5555555555\",\"email\":null,\"mode\":\"test\",\"carrier_facility\":null,\"residential\":true,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{\"zip4\":{\"success\":true,\"errors\":[],\"details\":null},\"delivery\":{\"success\":true,\"errors\":[],\"details\":{\"latitude\":37.77551,\"longitude\":-122.39697,\"time_zone\":\"America/Los_Angeles\"}}}},\"forms\":[],\"fees\":[{\"object\":\"Fee\",\"type\":\"LabelFee\",\"amount\":\"0.00000\",\"charged\":true,\"refunded\":false},{\"object\":\"Fee\",\"type\":\"PostageFee\",\"amount\":\"5.49000\",\"charged\":true,\"refunded\":false},{\"object\":\"Fee\",\"type\":\"InsuranceFee\",\"amount\":\"0.25000\",\"charged\":true,\"refunded\":false}],\"id\":\"shp_ca76f3c8f81647308da5e422446b8d21\",\"object\":\"Shipment\"}"
          },
          "cookies": [],
          "headers": [
            {
              "name": "x-frame-options",
              "value": "SAMEORIGIN"
            },
            {
              "name": "x-xss-protection",
              "value": "1; mode=block"
            },
            {
              "name": "x-content-type-options",
              "value": "nosniff"
            },
            {
              "name": "x-download-options",
              "value": "noopen"
            },
            {
              "name": "x-permitted-cross-domain-policies",
              "value": "none"
            },
            {
              "name": "referrer-policy",
              "value": "strict-origin-when-cross-origin"
            },
            {
              "name": "x-ep-request-uuid",
              "value": "7e75eef5628c0fdde79a6499000a8127"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "pragma",
              "value": "no-cache"
            },
            {
              "name": "expires",
              "value": "0"
            },
            {
              "name": "location",
              "value": "/api/v2/shipments/shp_ca76f3c8f81647308da5e422446b8d21"
            },
            {
              "name": "content-type",
              "value": "application/json; charset=utf-8"
            },
            {
              "name": "etag",
              "value": "W/\"4fddead17897b9c5b77381f3439bb208\""
            },
            {
              "name": "x-runtime",
              "value": "0.974092"
            },
            {
              "name": "content-encoding",
              "value": "gzip"
            },
            {
              "name": "transfer-encoding",
              "value": "chunked"
            },
            {
              "name": "x-node",
              "value": "bigweb8nuq"
            },
            {
              "name": "x-version-label",
              "value": "easypost-202205232148-f798679516-master"
            },
            {
              "name": "x-backend",
              "value": "easypost"
            },
            {
              "name": "x-proxied",
              "value": "intlb2nuq 570dfcbc0a, extlb2nuq c51cdb8bf2"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=31536000; includeSubDomains; preload"
            },
            {
              "name": "connection",
              "value": "close"
            }
          ],
          "headersSize": 810,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "/api/v2/shipments/shp_ca76f3c8f81647308da5e422446b8d21",
          "status": 201,
          "statusText": "Created"
        },
        "startedDateTime": "2022-05-23T22:51:08.987Z",
        "time": 1163,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 1163
        }
      },
      {
        "_id": "e3fa6ae8ea41ab304bdbec4090d9d5b1",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 0,
          "cookies": [],
          "headers": [
            {
              "name": "accept-encoding",
              "value": "gzip, deflate"
            },
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "host",
              "value": "api.easypost.com"
            }
          ],
          "headersSize": 508,
          "httpVersion": "HTTP/1.1",
          "method": "GET",
          "queryString": [],
          "url": "https://api.easypost.com/v2/shipments/shp_ca76f3c8f81647308da5e422446b8d21"
        },
        "response": {
          "bodySize": 2626,
          "content": {
            "encoding": "base64",
            "mimeType": "application/json; charset=utf-8",
            "size": 2626,
            "text": "[\"H4sIAAAAAAAAA+xZbVPcOBL+K1P+ujDI8jvfpiawyW4WWGZym3CVcsmSPIh4bJcsh0Aq//1akm3mBcJckQ1Xt6RSxbjVarWeftxSt786VHKiOEuJcg4djDDeR8E+9uYYHwbuIUounD1HNKnkqpWlc5iTouF7zpI3DVnwxjn890d4qhiH2Yo3CrSrWomqhKGvDm2l5CW9gcF3s1cwVpObJS+VHlM3tZ40Ozp5dXTufNtzGPiREvaZlBQGEEgkz7meD49lWxR7TqOIasGy05afyuq6BItKEvpJlIuUWicSHyFX/0+80HUx8sMkQREotjX7zkZdpDeaEUUvU8H69exzv+qqrAOgF9K2UdWySUWZV70sl9US9sMkqOoNa7MOYTJlIWacRZgRTlyX09ijLqFuHmaIIOZyjWF2xal2dNLN33s0UL8gdIjQoxtdUSzJUiP2GwA4mtVEyupar1Mta1LqkB2R5uasMjFtlORcuSD04ng0B+gbXrLR7G4Ma2drNcLaMhVKG5iRcnQsIZ6ioZVjw6dXnE7g4VbUJlyuiQ6t2lJJSxTNk8uq1JrB8A+EfElE0aO7zjkK3gsu05xQUZjFrRZgJxgQTpBhYs4Zl6RIFfmyEmnj2obsM5ciF5T0dP4GlBRl00rLUCdAY4NjJcHiyjyAkvJiCHktaZESn8YxRlmCc9cnEc5CmnFO3TDzYxyEbDXmZ3b+4yG/2CHaWqfg5UJdOkDyMdpzrgXTD7H+fcnF4hJm+vqhlgBNLkqwVgMnVuh93am5wdhfhx4gqYEioJsWJLO7vtuIHXlrBvY6NIqUUy/j8I4mEaE+imjielHkBwiHiMdBmPzAnW/kFB0/xRfSzMsruYSZpWYaYKSdTJkl6EM4Gh3gVFW0mhTOoYdQL27ErZ7qfwkHzS7FAaikLdQgzkXB+zGxBIAO6nIxjLYSQHQulaqbw4MDDu+gBnhfT2rGjTdum/1rQH4fj8mS3FYluW7G8M4eGIWDtWAc6H2gAHsHvg==\",\"7wdJwJibk8wnOIlzStyIJPDbp3kSjFc9qFluvbDBt8LbutgW8rrA21LtiZXoHA6I6mOiexn0Y+pylkcoh1wXYT9iKIs5j6iHPI5CPw/z1ZfhXEfkxxFiPW00XH4W5l0++lL3edamEpOJznQukh0nvHGks9DWmQZHI+SltFeLxj66k25pF6JR6YZJI9vSzERR6IOtY0rPBM1qXghITjdA15vhXFoRKn6vMF20BHKX4pwNBzngkN5rrrkUtT6qTV6DpzqlJApzj8Z57IZ+5KGYkYD7GPt+mMUMuytpmFCTz+1cStIgIxElXuhhGviE8Qy4x/yMwqkHBhMEaWSVH1ngMt/3MBCV+yEPiMuwl5GcIS8KYy94Bn6cSVFJfbA8TJBo7EWP8yMeR7vSozP4RHa4P5Aa7vPyggQZ9/KAeWHi+4hzkiOf8oh4SehmcKl6Dl6Ys3rGC73q97iB8ePc6LR244ZRfSI38A/kBn5ebnAWRtyPI5ww5ifUI5TgnLpwnaAkz3z8DNw4FrL5HingMpU8TopOaxdSdKr/aFJ8NGVjW7KNsq2hpOyufJ3AvLMQWgveC5deuLSVYGx3QcPd0UPJTylDNKB5niMehj7KowQTbSmMoiQIYhSusmPezd8M7M5di6HjAdfTFGaVjVCDGBBSpiTuny3DHqWjbXbs0hBpxEKXg9nNZiVonzaidH/t1Fl6Quju2D7gZnduC4t1tGH0lYVlaFOZ+xvfn3UujN6UeTWa6V+qGnWWGW+oFLUt6za6Tf8d9vqPEss7LPwtLKpWmre6W7tnqCWDXXzYaVHZDsRaZd3v9G0/2PdcVroZQ2+qb63YR9N3McWZPkB3wU7jVsPQyBTyo6nl1t+OmT933UMc//2YOa9P383mpycrHar5e+d+4JwoQqHnfNPnTM77BmjvTL+/lVWndmiAdSOl708L0jSjM9tvAVLaUb14CTNKMGqT7AMvnNlqce+wxnN9GCqYhShX0Ol3Ppq/3xvBzpDrDFo/EUzDJCVKY2nVvenryfnbI+PhbLo3wpAmXWdd+x437Qp3h8pmirLjpFBclhpC2yHMTaKxY6IUumV4N5EoxZe1GroadZsVgm70aowr4/4wNE0ZdnUUste/yff4z+sPt/+6ulheLP/49R0+ufrz+uKKBn8sj8WHObs6uaLe6fyde/pqgs25Uz3UOaaIRUnfOc5iL7edYxplXrh2MfkZnePJ9PfR7Gxyfn76l7PWOZ7MPpydzubOVuf49K8T3fEfzeajydncdouHBnKXr7rm8eRkdHw+OZm+mU1PnYebx/tuaCrqn9FBVrLlT+kga799/bdpKTXBtRa5lJXscslwsnVU6zm467SvTgHrqVZvzovGURQEULYXVbnohPsuxmMomZMIeKZzxK1FarIEbyk5eFs16aRcwPW4gTynm95tUzedlmtuj60sX75s/J992cjaG31Jfsk6L1nnfyPr6GK9W6a7aa3cP465TiZd/WnupVZCljogINPf5pChDb0kcqFLS+u+7Q4MpebaJXjNavf1asOuroufZvdN/wlxy2Mc7GT5Y/cpbcciavCir3+cb/8BAAD//w==\",\"AwC/b8vX9x8AAA==\"]"
          },
          "cookies": [],
          "headers": [
            {
              "name": "x-frame-options",
              "value": "SAMEORIGIN"
            },
            {
              "name": "x-xss-protection",
              "value": "1; mode=block"
            },
            {
              "name": "x-content-type-options",
              "value": "nosniff"
            },
            {
              "name": "x-download-options",
              "value": "noopen"
            },
            {
              "name": "x-permitted-cross-domain-policies",
              "value": "none"
            },
            {
              "name": "referrer-policy",
              "value": "strict-origin-when-cross-origin"
            },
            {
              "name": "x-ep-request-uuid",
              "value": "7e75eefb628c0fdee79a649a000a8176"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "pragma",
              "value": "no-cache"
            },
            {
              "name": "expires",
              "value": "0"
            },
            {
              "name": "content-type",
              "value": "application/json; charset=utf-8"
            },
            {
              "name": "etag",
              "value": "W/\"f3f59f9d5e3fa055473fa6b923878bde\""
            },
            {
              "name": "x-runtime",
              "value": "0.135726"
            },
            {
              "name": "content-encoding",
              "value": "gzip"
            },
            {
              "name": "transfer-encoding",
              "value": "chunked"
            },
            {
              "name": "x-node",
              "value": "bigweb6nuq"
            },
            {
              "name": "x-version-label",
              "value": "easypost-202205232148-f798679516-master"
            },
            {
              "name": "x-backend",
              "value": "easypost"
            },
            {
              "name": "x-proxied",
              "value": "intlb2nuq 570dfcbc0a, extlb2nuq c51cdb8bf2"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=31536000; includeSubDomains; preload"
            },
            {
              "name": "connection",
              "value": "close"
            }
          ],
          "headersSize": 744,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2022-05-23T22:51:10.156Z",
        "time": 327,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 327
        }
      },
      {
        "_id": "8c49905bee1de183019a5579471a53e6",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 71,
          "cookies": [],
          "headers": [
            {
              "name": "accept-encoding",
              "value": "gzip, deflate"
            },
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": 71
            },
            {
              "name": "host",
              "value": "api.easypost.com"
            }
          ],
          "headersSize": 490,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/json",
            "params": [],
            "text": "{\"refund\":{\"carrier\":\"USPS\",\"tracking_codes\":\"9400100109361120469907\"}}"
          },
          "queryString": [],
          "url": "https://api.easypost.com/v2/refunds"
        },
        "response": {
          "bodySize": 316,
          "content": {
            "encoding": "base64",
            "mimeType": "application/json; charset=utf-8",
            "size": 316,
            "text": "[{\"id\":\"rfnd_3cf3f1c250414a559d170de66f73d2ea\",\"object\":\"Refund\",\"created_at\":\"2022-05-23T22:51:10Z\",\"updated_at\":\"2022-05-23T22:51:10Z\",\"tracking_code\":\"9400100109361120469907\",\"confirmation_number\":null,\"status\":\"submitted\",\"carrier\":\"USPS\",\"shipment_id\":\"shp_ca76f3c8f81647308da5e422446b8d21\"}]"
          },
          "cookies": [],
          "headers": [
            {
              "name": "x-frame-options",
              "value": "SAMEORIGIN"
            },
            {
              "name": "x-xss-protection",
              "value": "1; mode=block"
            },
            {
              "name": "x-content-type-options",
              "value": "nosniff"
            },
            {
              "name": "x-download-options",
              "value": "noopen"
            },
            {
              "name": "x-permitted-cross-domain-policies",
              "value": "none"
            },
            {
              "name": "referrer-policy",
              "value": "strict-origin-when-cross-origin"
            },
            {
              "name": "x-ep-request-uuid",
              "value": "7e75eef5628c0fdee79a649b000a8191"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "pragma",
              "value": "no-cache"
            },
            {
              "name": "expires",
              "value": "0"
            },
            {
              "name": "content-type",
              "value": "application/json; charset=utf-8"
            },
            {
              "name": "etag",
              "value": "W/\"26d1140f19839005ad0c1e27972ba843\""
            },
            {
              "name": "x-runtime",
              "value": "0.078004"
            },
            {
              "name": "content-encoding",
              "value": "gzip"
            },
            {
              "name": "transfer-encoding",
              "value": "chunked"
            },
            {
              "name": "x-node",
              "value": "bigweb5nuq"
            },
            {
              "name": "x-version-label",
              "value": "easypost-202205232148-f798679516-master"
            },
            {
              "name": "x-backend",
              "value": "easypost"
            },
            {
              "name": "x-proxied",
              "value": "intlb1nuq 570dfcbc0a, extlb2nuq c51cdb8bf2"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=31536000; includeSubDomains; preload"
            },
            {
              "name": "connection",
              "value": "close"
            }
          ],
          "headersSize": 744,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 201,
          "statusText": "Created"
        },
        "startedDateTime": "2022-05-23T22:51:10.488Z",
        "time": 274,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 274
        }
      }
    ],
    "pages": [],
    "version": "1.2"
  }
}
